week09/1-micro-blog/app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "comments" ("commenter", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "sashiba"], ["body", "i ko sq\r\n"], ["post_id", 2], ["created_at", "2016-02-10 12:32:53.985593"], ["updated_at", "2016-02-10 12:32:53.985593"]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)