week09/1-Micro-Blog/app/controllers/photos_controller.rb

INSERT INTO "photos" ("url", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["url", "http://zoarchurch.co.uk/content/pages/uploaded_images/91.png"], ["name", "Google Image"], ["created_at", "2016-02-12 16:52:21.018087"], ["updated_at", "2016-02-12 16:52:21.018087"]]
---
  def create
    @photo = Photo.new(photo_params)
    if @photo.save