week09/1-micro-blog/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("name", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "ASDASD"], ["content", "ASDasd"], ["created_at", "2016-02-09 20:33:22.319937"], ["updated_at", "2016-02-09 20:33:22.319937"]]