week09/1-micro-blog/app/controllers/welcome_controller.rb

SELECT "photos".* FROM "photos"
SELECT "posts".* FROM "posts"
---
  def index
    @photos = Photo.all
    @posts = Post.all