week10/1-online-store/app/controllers/brands_controller.rb

SELECT "brands".* FROM "brands"
---
  def index
    render json: Brand.all

SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT 1  [["id", nil]]
---
  def show
    render json: Brand.find(params[:id])

INSERT INTO "brands" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "testbrand"], ["description", "test_brand_descrotpiiosdods"], ["created_at", "2016-02-14 15:42:31.554943"], ["updated_at", "2016-02-14 15:42:31.554943"]]
---
  def create
    # <<-JSON
    # {
    #   "name": "So fancy",
    #   "quality": "SSS"
    #  }
    # JSON
    # params[:name], params[:quality]
    # params[:controller] # brands
    # params[:action] # create
    # params[:brand] = { name: 'So Fancy', quality: 'SS' }
    # Brand.new(params)
    @brand = Brand.create!(brand_params)

SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT 1  [["id", 6]]
---
  def edit
    @brand = Brand.find(params[:id])

SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "brands" WHERE "brands"."id" = ?  [["id", 4]]
---
  def destroy
    @brand = Brand.find(params[:id])
    @brand.destroy

SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "brands" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "brands"."id" = ?  [["name", "t-updated"], ["description", "pathed"], ["updated_at", "2016-02-17 16:06:18.081367"], ["id", 6]]
---
  def update
    @brand = Brand.find(params[:id])
    @brand.update!(brand_params)

SELECT COUNT(*) FROM "brands"
---
  def count
    @brands = Brand.all.count

SELECT "brands".* FROM "brands" WHERE ("brands"."id" BETWEEN 1 AND 2)
---
  def range_count
    render json: Brand.where('id >= ?', params[:id]).limit(params[:count].to_i)

SELECT "brands".* FROM "brands" WHERE (id >= '1')
---
  def range_index
    render json: Brand.where('id >= ?', params[:id])