week10/1-online-store/app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
---
  def index
    render json: Category.all

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    render json: Category.find(params[:id])

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "newcategory"], ["created_at", "2016-02-17 16:23:56.992690"], ["updated_at", "2016-02-17 16:23:56.992690"]]
---
  def create
    @category = Category.create!(category_params)

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "testcategory2"], ["updated_at", "2016-02-18 12:12:19.513930"], ["id", 2]]
---
  def update
    @category = Category.find(params[:id])
    @category.update!(category_params)

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 3]]
SELECT "categories".* FROM "categories"
---
  def destroy
    @category = Category.find(params[:id])
    @category.destroy
    render json: Category.all

SELECT COUNT(*) FROM "categories"
---
  def count
    @categories = Category.all.count

SELECT "categories".* FROM "categories" WHERE ("categories"."id" BETWEEN 1 AND 0)
---
  def range_count
    render json: Category.where('id >= ?', params[:id]).limit(params[:count].to_i)

SELECT "categories".* FROM "categories" WHERE (id >= '1')
---
  def range_index
    render json: Category.where('id >= ?', params[:id])