week10/1-online-store/app/controllers/products_controller.rb

  def index
    render json: Product.all
---
SELECT "products".* FROM "products"

  def show
    render json: Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @product = Product.create!(product_params)
---
INSERT INTO "products" ("name", "brand_id", "category_id", "price", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "new product"], ["brand_id", 1], ["category_id", 5], ["price", 220.0], ["quantity", 45], ["created_at", "2016-02-20 11:35:14.041665"], ["updated_at", "2016-02-20 11:35:14.041665"]]

  def destroy
    @product = Product.find(params[:id])
    @product.destroy
    render json: Product.all
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 3]]
SELECT "products".* FROM "products"

  def update
    @product = Product.find(params[:id])
    @product.update!(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "products" SET "category" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["category", "textcat"], ["updated_at", "2016-02-18 12:29:37.005538"], ["id", 2]]

  def count
   render json: Product.all.count
---
SELECT COUNT(*) FROM "products"

  def range_count
    render json: Product.where('id >= ?', params[:id]).limit(params[:count].to_i)
---
SELECT  "products".* FROM "products" WHERE (id >= '1') LIMIT 4

  def range_index
    render json: Product.where('id >= ?', params[:id])
---
SELECT "products".* FROM "products" WHERE (id >= '1')