week11/1-course-management/app/controllers/lectures_controller.rb

SELECT "lectures".* FROM "lectures"
---
  def index
    @lectures = Lecture.all

SELECT  "lectures".* FROM "lectures" WHERE "lectures"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @lecture = Lecture.find(params[:id])

SELECT  "lectures".* FROM "lectures" WHERE "lectures"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @lecture = Lecture.find(params[:id])

INSERT INTO "lectures" ("name", "text_body") VALUES (?, ?)  [["name", "test 4"], ["text_body", "sdasdsdkkggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggg"]]
---
  def create
    @lecture = Lecture.create!(lecture_params)

SELECT  "lectures".* FROM "lectures" WHERE "lectures"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "lectures" WHERE "lectures"."id" = ?  [["id", 1]]
---
  def destroy
    @lecture = Lecture.find(params[:id])
    @lecture.destroy

SELECT  "lectures".* FROM "lectures" WHERE "lectures"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "lectures" SET "text_body" = ? WHERE "lectures"."id" = ?  [["text_body", "fffffff"], ["id", 5]]
---
  def update
    @lecture = Lecture.find(params[:id])
    @lecture.update!(lecture_params)