week11/1-course-management/app/controllers/solutions_controller.rb

SELECT  "solutions".* FROM "solutions" WHERE "solutions"."task_id" = ? AND "solutions"."id" = ? LIMIT 1  [["task_id", 13], ["id", 1]]
---
  def show
    @solution = @task.solutions.find(params[:id])

SELECT  "solutions".* FROM "solutions" WHERE "solutions"."task_id" = ? AND "solutions"."id" = ? LIMIT 1  [["task_id", 13], ["id", 1]]
---
  def edit
    @solution = @task.solutions.find(params[:id])

INSERT INTO "solutions" ("text_block", "task_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["text_block", "reshenieto"], ["task_id", 13], ["created_at", "2016-02-26 15:24:20.560114"], ["updated_at", "2016-02-26 15:24:20.560114"]]
---
  def create
    @solution = @task.solutions.create!(solution_params)

SELECT  "solutions".* FROM "solutions" WHERE "solutions"."task_id" = ? AND "solutions"."id" = ? LIMIT 1  [["task_id", 13], ["id", 1]]
UPDATE "solutions" SET "text_block" = ?, "updated_at" = ? WHERE "solutions"."id" = ?  [["text_block", "reshenietofff"], ["updated_at", "2016-02-26 15:26:18.913108"], ["id", 1]]
---
  def update
    @solution = @task.solutions.find(params[:id])
    @solution.update!(solution_params)

SELECT  "solutions".* FROM "solutions" WHERE "solutions"."task_id" = ? AND "solutions"."id" = ? LIMIT 1  [["task_id", 13], ["id", 2]]
DELETE FROM "solutions" WHERE "solutions"."id" = ?  [["id", 2]]
---
  def destroy
    @solution = @task.solutions.find(params[:id])
    @solution.destroy

SELECT  "lectures".* FROM "lectures" WHERE "lectures"."id" = ? LIMIT 1  [["id", 6]]
---
  def set_lecture
    @lecture = Lecture.find(params[:lecture_id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."lecture_id" = ? AND "tasks"."id" = ? LIMIT 1  [["lecture_id", 6], ["id", 13]]
---
  def set_task
    set_lecture
    @task = @lecture.tasks.find(params[:task_id])