week11/1-course-management/app/controllers/tasks_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."lecture_id" = ? AND "tasks"."id" = ? LIMIT 1  [["lecture_id", 4], ["id", 1]]
---
  def show
    @task = @lecture.tasks.find(params[:id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."lecture_id" = ? AND "tasks"."id" = ? LIMIT 1  [["lecture_id", 4], ["id", 1]]
---
  def edit
    @task = @lecture.tasks.find(params[:id])

INSERT INTO "tasks" ("name", "description", "lecture_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "sashib"], ["description", "sasas\r\n"], ["lecture_id", 4], ["created_at", "2016-02-25 19:27:34.119944"], ["updated_at", "2016-02-25 19:27:34.119944"]]
---
  def create
    @task = @lecture.tasks.create!(task_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."lecture_id" = ? AND "tasks"."id" = ? LIMIT 1  [["lecture_id", 4], ["id", 12]]
UPDATE "tasks" SET "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", "EDITNATAsdsd\r\n"], ["updated_at", "2016-02-26 14:49:24.485335"], ["id", 13]]
---
  def update
    @task = @lecture.tasks.find(params[:id])
    @task.update!(task_params)

SELECT  "lectures".* FROM "lectures" WHERE "lectures"."id" = ? LIMIT 1  [["id", nil]]
---
  def set_lecture
    @lecture = Lecture.find(params[:lecture_id])